commercial_flexible_table.dot
digraph DataArchitecture {
  rankdir=LR;
  node [shape=box, style=filled];

  subgraph cluster_model {
    label="MODEL";
    style=rounded;

    urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_commercial_flexible_table [label="commercial_flexible_table" fillcolor="#FFFFFF"];
    urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_dbt_model_runtime [label="dbt_model_runtime" fillcolor="#FFFFFF"];
    urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_vw_data_product_refresh_monitor [label="vw_data_product_refresh_monitor" fillcolor="#FFFFFF"];
  }

  subgraph cluster_bronze {
    label="BRONZE";
    style=rounded;

    urn_dab_dbt_source_sales_analytics_reporting_SALES_FINANCIAL_MEASURES_COMMON_VIEW_DIM_SUPPLIER_HERITAGE [label="VIEW_DIM_SUPPLIER_HERITAGE" fillcolor="#CD7F32"];
    urn_dab_dbt_source_sales_analytics_reporting_SALES_WH_LDBA_COMMON_VWDAVLD [label="VWDAVLD" fillcolor="#CD7F32"];
    urn_dab_dbt_source_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_HERITAGE_COMMON_CR_DIM_CALENDAR [label="CR_DIM_CALENDAR" fillcolor="#CD7F32"];
    urn_dab_dbt_source_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_HERITAGE_COMMON_SALES_VIS_WIDA_DAILY [label="SALES_VIS_WIDA_DAILY" fillcolor="#CD7F32"];
    urn_dab_dbt_source_sales_analytics_reporting_SALES_WH_LDBA_COMMON_VSDMBLD [label="VSDMBLD" fillcolor="#CD7F32"];
    urn_dab_dbt_source_sales_analytics_reporting_SALES_FINANCIAL_MEASURES_COMMON_DIM_LOCATION [label="DIM_LOCATION" fillcolor="#CD7F32"];
    urn_dab_dbt_source_sales_analytics_reporting_SALES_MARGIN_CORE_COMMON_FACT_MARGIN_HERITAGE [label="FACT_MARGIN_HERITAGE" fillcolor="#CD7F32"];
    urn_dab_dbt_source_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_HERITAGE_COMMON_DIM_OFFER [label="DIM_OFFER" fillcolor="#CD7F32"];
    urn_dab_dbt_source_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_HERITAGE_COMMON_DIM_PROMOTION [label="DIM_PROMOTION" fillcolor="#CD7F32"];
    urn_dab_dbt_source_sales_analytics_reporting_SALES_STOCK_LEDGER_HERITAGE_CORE_FACT_STOCK_LEDGER_HERITAGE [label="FACT_STOCK_LEDGER_HERITAGE" fillcolor="#CD7F32"];
    urn_dab_dbt_source_sales_analytics_reporting_SALES_BAZAARVOICE_CURATED_STANDARD_CLIENT_FEED_UNNESTED [label="STANDARD_CLIENT_FEED_UNNESTED" fillcolor="#CD7F32"];
    urn_dab_dbt_source_sales_analytics_reporting_SALES_WH_LDBA_COMMON_TJDAY00 [label="TJDAY00" fillcolor="#CD7F32"];
    urn_dab_dbt_source_sales_analytics_reporting_SALES_COMM_MEASURE_CUR_COMMON_TMCOMPL [label="TMCOMPL" fillcolor="#CD7F32"];
    urn_dab_dbt_source_sales_analytics_reporting_SALES_EPOS_COMMON_LOAD_LDBA_TSBKMOD_INCR [label="LOAD_LDBA_TSBKMOD_INCR" fillcolor="#CD7F32"];
    urn_dab_dbt_source_sales_analytics_reporting_SALES_EPOS_COMMON_LOAD_LDBA_TSBASKT_INCR [label="LOAD_LDBA_TSBASKT_INCR" fillcolor="#CD7F32"];
    urn_dab_dbt_source_sales_analytics_reporting_SALES_WH_LDBA_COMMON_VLINEC2 [label="VLINEC2" fillcolor="#CD7F32"];
    urn_dab_dbt_source_sales_analytics_reporting_SALES_PRODUCT_CORE_COMMON_DIM_SALES_MERCHANDISING_HIERARCHY [label="DIM_SALES_MERCHANDISING_HIERARCHY" fillcolor="#CD7F32"];
    urn_dab_dbt_source_sales_analytics_reporting_SALES_PRODUCT_CORE_COMMON_DIM_PRODUCT [label="DIM_PRODUCT" fillcolor="#CD7F32"];
    urn_dab_dbt_source_sales_analytics_reporting_SALES_FINANCIAL_MEASURES_COMMON_DIM_PRODUCT [label="DIM_PRODUCT" fillcolor="#CD7F32"];
    urn_dab_dbt_source_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_HERITAGE_COMMON_SALES_SPLIT_PROMO_CALENDAR [label="SALES_SPLIT_PROMO_CALENDAR" fillcolor="#CD7F32"];
  }

  subgraph cluster_silver {
    label="SILVER";
    style=rounded;

    urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_int_commercial_flexible_measures [label="int_commercial_flexible_measures" fillcolor="#C0C0C0"];
    urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_vwdavld [label="stg_common_vwdavld" fillcolor="#C0C0C0"];
    urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_dim_calendar [label="stg_common_dim_calendar" fillcolor="#C0C0C0"];
    urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_wida_daily [label="stg_common_wida_daily" fillcolor="#C0C0C0"];
    urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_vsdmbld_oos [label="stg_common_vsdmbld_oos" fillcolor="#C0C0C0"];
    urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_int_commercial_flexible_margin [label="int_commercial_flexible_margin" fillcolor="#C0C0C0"];
    urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_fct_margin [label="stg_common_fct_margin" fillcolor="#C0C0C0"];
    urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_dim_offer [label="stg_common_dim_offer" fillcolor="#C0C0C0"];
    urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_dim_promotion [label="stg_common_dim_promotion" fillcolor="#C0C0C0"];
    urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_dim_location [label="stg_common_dim_location" fillcolor="#C0C0C0"];
    urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_cr_receipt [label="stg_common_cr_receipt" fillcolor="#C0C0C0"];
    urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_commercial_flexible_applicability_count [label="stg_commercial_flexible_applicability_count" fillcolor="#C0C0C0"];
    urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_view_overall_ratings [label="stg_common_view_overall_ratings" fillcolor="#C0C0C0"];
    urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_commercial_flexible_complaints [label="stg_commercial_flexible_complaints" fillcolor="#C0C0C0"];
    urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_tmcompl [label="stg_common_tmcompl" fillcolor="#C0C0C0"];
    urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_cr_branch_trigger_ct [label="stg_common_cr_branch_trigger_ct" fillcolor="#C0C0C0"];
    urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_dim_product [label="stg_common_dim_product" fillcolor="#C0C0C0"];
    urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_dim_product_v2 [label="stg_common_dim_product_v2" fillcolor="#C0C0C0"];
    urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_split_promotion_calendar [label="stg_common_split_promotion_calendar" fillcolor="#C0C0C0"];
  }

  urn_dab_dbt_source_sales_analytics_reporting_SALES_FINANCIAL_MEASURES_COMMON_VIEW_DIM_SUPPLIER_HERITAGE -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_commercial_flexible_table [label="FLOWS_TO"];
  urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_int_commercial_flexible_measures -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_commercial_flexible_table [label="FLOWS_TO"];
  urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_dbt_model_runtime -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_int_commercial_flexible_measures [label="FLOWS_TO"];
  urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_vwdavld -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_int_commercial_flexible_measures [label="FLOWS_TO"];
  urn_dab_dbt_source_sales_analytics_reporting_SALES_WH_LDBA_COMMON_VWDAVLD -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_vwdavld [label="FLOWS_TO"];
  urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_dim_calendar -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_vwdavld [label="FLOWS_TO"];
  urn_dab_dbt_source_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_HERITAGE_COMMON_CR_DIM_CALENDAR -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_dim_calendar [label="FLOWS_TO"];
  urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_wida_daily -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_int_commercial_flexible_measures [label="FLOWS_TO"];
  urn_dab_dbt_source_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_HERITAGE_COMMON_SALES_VIS_WIDA_DAILY -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_wida_daily [label="FLOWS_TO"];
  urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_vsdmbld_oos -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_int_commercial_flexible_measures [label="FLOWS_TO"];
  urn_dab_dbt_source_sales_analytics_reporting_SALES_WH_LDBA_COMMON_VSDMBLD -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_vsdmbld_oos [label="FLOWS_TO"];
  urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_int_commercial_flexible_margin -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_int_commercial_flexible_measures [label="FLOWS_TO"];
  urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_fct_margin -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_int_commercial_flexible_margin [label="FLOWS_TO"];
  urn_dab_dbt_source_sales_analytics_reporting_SALES_FINANCIAL_MEASURES_COMMON_DIM_LOCATION -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_fct_margin [label="FLOWS_TO"];
  urn_dab_dbt_source_sales_analytics_reporting_SALES_MARGIN_CORE_COMMON_FACT_MARGIN_HERITAGE -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_fct_margin [label="FLOWS_TO"];
  urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_dim_offer -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_int_commercial_flexible_margin [label="FLOWS_TO"];
  urn_dab_dbt_source_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_HERITAGE_COMMON_DIM_OFFER -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_dim_offer [label="FLOWS_TO"];
  urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_dim_promotion -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_int_commercial_flexible_margin [label="FLOWS_TO"];
  urn_dab_dbt_source_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_HERITAGE_COMMON_DIM_PROMOTION -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_dim_promotion [label="FLOWS_TO"];
  urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_dim_location -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_int_commercial_flexible_margin [label="FLOWS_TO"];
  urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_cr_receipt -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_int_commercial_flexible_margin [label="FLOWS_TO"];
  urn_dab_dbt_source_sales_analytics_reporting_SALES_STOCK_LEDGER_HERITAGE_CORE_FACT_STOCK_LEDGER_HERITAGE -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_cr_receipt [label="FLOWS_TO"];
  urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_commercial_flexible_applicability_count -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_int_commercial_flexible_measures [label="FLOWS_TO"];
  urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_view_overall_ratings -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_int_commercial_flexible_measures [label="FLOWS_TO"];
  urn_dab_dbt_source_sales_analytics_reporting_SALES_BAZAARVOICE_CURATED_STANDARD_CLIENT_FEED_UNNESTED -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_view_overall_ratings [label="FLOWS_TO"];
  urn_dab_dbt_source_sales_analytics_reporting_SALES_WH_LDBA_COMMON_TJDAY00 -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_view_overall_ratings [label="FLOWS_TO"];
  urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_commercial_flexible_complaints -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_int_commercial_flexible_measures [label="FLOWS_TO"];
  urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_tmcompl -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_commercial_flexible_complaints [label="FLOWS_TO"];
  urn_dab_dbt_source_sales_analytics_reporting_SALES_COMM_MEASURE_CUR_COMMON_TMCOMPL -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_tmcompl [label="FLOWS_TO"];
  urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_cr_branch_trigger_ct -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_int_commercial_flexible_measures [label="FLOWS_TO"];
  urn_dab_dbt_source_sales_analytics_reporting_SALES_EPOS_COMMON_LOAD_LDBA_TSBKMOD_INCR -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_cr_branch_trigger_ct [label="FLOWS_TO"];
  urn_dab_dbt_source_sales_analytics_reporting_SALES_EPOS_COMMON_LOAD_LDBA_TSBASKT_INCR -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_cr_branch_trigger_ct [label="FLOWS_TO"];
  urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_dim_product -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_commercial_flexible_table [label="FLOWS_TO"];
  urn_dab_dbt_source_sales_analytics_reporting_SALES_WH_LDBA_COMMON_VLINEC2 -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_dim_product [label="FLOWS_TO"];
  urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_dim_product_v2 -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_dim_product [label="FLOWS_TO"];
  urn_dab_dbt_source_sales_analytics_reporting_SALES_PRODUCT_CORE_COMMON_DIM_SALES_MERCHANDISING_HIERARCHY -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_dim_product_v2 [label="FLOWS_TO"];
  urn_dab_dbt_source_sales_analytics_reporting_SALES_PRODUCT_CORE_COMMON_DIM_PRODUCT -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_dim_product_v2 [label="FLOWS_TO"];
  urn_dab_dbt_source_sales_analytics_reporting_SALES_FINANCIAL_MEASURES_COMMON_DIM_PRODUCT -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_dim_product_v2 [label="FLOWS_TO"];
  urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_split_promotion_calendar -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_commercial_flexible_table [label="FLOWS_TO"];
  urn_dab_dbt_source_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_HERITAGE_COMMON_SALES_SPLIT_PROMO_CALENDAR -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_stg_common_split_promotion_calendar [label="FLOWS_TO"];
  urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_commercial_flexible_table -> urn_dab_dbt_model_sales_analytics_reporting_SALES_ANALYTICS_REPORTING_vw_data_product_refresh_monitor [label="FLOWS_TO"];
}
